Revit 2024 API
BuiltInFailures.MEPSupportFailures Class
 Failures about MEP suppor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class MEPSupportFailures
Visual Basic
Public NotInheritable Class MEPSupportFailures
Visual C++
public ref class MEPSupportFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.MEPSupportFailures
See Also
BuiltInFailures.MEPSupportFailures Members
Autodesk.Revit.DB Namespace